{
  "startMessage": "Hello! I'm HotelAssist bot for Edem Resort Medical & SPA. How can I help you?",
  "additionalServices": "Registration of additional services",
  "feedback": "Feedback and evaluations",
  "cityHelp": "Help for the city",
  "checkInOut": "Quick check-in/check-out",
  "bookRoom": "Book a room",
  "nextButton": "Next",
  "backButton": "Back",
  "enterFirstName": "Please enter your first name.",
  "enterLastName": "Please enter your last name.",
  "invalidLastName": "Invalid last name. Please, try again.",
  "invalidPhoneNumber": "Invalid phone number. Please, try again.",
  "invalidFirstName": "Invalid first name. Please, try again.",
  "invalidDateFormat": "The format is incorrect or the date is in the past. Please, try again.",
  "sharePhoneNumber": "We need your phone number to complete the booking. Please share it via the button below.",
  "checkoutEarlierThanCheckin": "The checkout date cannot be earlier or equal the check-in date. Please, try again.",
  "noContactInfoReceived": "No contact info received. Please, share your contact to continue reservation.",
  "shareContact": "Share your contact to continue reservation.",
  "enterCheckInDate": "Write a check-in date. The format should be DD/MM/YYYY",
  "enterCheckoutDate": "Please, write a checkout date. The format should be DD/MM/YYYY",
  "bookingProcess": {
    "bookButton": "Book this one",
    "roomDetails": "Room Type: {{type}}. Price: {{price}} UAH. Guests: {{guests}}",
    "bookingConfirmation": "Booking confirmed! Room: {{roomType}}. Check-in: {{checkIn}}, Check-out: {{checkOut}}, Total nights: {{totalDays}}. Total price: {{totalPrice}} UAH. Name: {{firstName}} {{lastName}}, Phone: {{phone}}. You can pay at the reception in the day of your arrival.",
    "noRoomsAvailable": "Something went wrong and this room type was not found. Please, reach our manager +380673146512 to fix your problem.",
    "seeOtherRooms": "See other rooms",
    "bookingError": "Seems like some error happened during booking. Please, try again to book the room.",
    "errorOccurred": "We are sorry to tell that some error happened during booking. Please, try again or reach to our manager directly +380673146512",
    "roomUnavailable": "Room {{roomType}} is unavailable in that dates. You can book {{roomType}} room from {{nextAvailableDate}} or look at other rooms.",
    "roomNotFound": "No room found with such id: {{roomId}}"
  },
  "extraServices": {
    "continueReservation": "Reserve it from {{nextAvailableDate}}",
    "selectService": "Please, select a service you are interested in to continue.",
    "serviceUnavailable": "Sorry, {{optionName}} of {{serviceName}} is unavailable. Eerlieast availaible date is {{nextAvailableDate}}.",
    "selectOptionSpa": "Selected program is {{programName}}. Select an option to continue",
    "selectedOption": "Selected option is {{optionName}}. Please, read the detials before continue booking.",
    "selectCategory": "Selected service is {{serviceName}}. Select a category to continue",
    "selectOption": "Selected service is {{serviceName}}. Select an option to continue.",
    "chosenService": "You have selected {{serviceName}} service",
    "spa": "SPA",
    "noOptionsAvailable": "Something went wrong and this option was not found. Please, reach our manager +380673146512 to fix your problem.",
    "bookingOptionError": "Seems like some error happened during booking this option. Please, try again to book the option.",
    "bookingOptionConfirmation": "Booking confirmed! Option: {{optionName}}. Check-in: {{checkIn}}, Check-out: {{checkOut}}. Price: {{totalPrice}}. Name: {{firstName}} {{lastName}}, Phone: {{phone}}. You can pay at the reception in the day of your arrival.",
    "oneDayPrograms": "One day programs",
    "oneDayProgramsDate": "Please, enter the suitable date for one day program of option {{optionName}}. The format should be DD/MM/YYYY",
    "noteCheckoutDate": "Please, note that your checkout date will be {{checkoutDate}}.",
    "abonmentWellnessDay": "Abonment Wellness-Day",
    "abonmentWellnessDayDesc": "- Access to the SPA area (pool; gym; Roman and Finnish saunas; bathhouse; hammam chairs; hydro massage mini pool; Swiss (circular) shower; Kneipp path; phyto bar). \n - Group fitness classes (Nordic walking, Black Roll training, Aqua aerobics, TRX, Bit Zone, Thai Bo, Fly yoga, Morning exercises).",
    "spaDayRelaxation": "SPA-Day «Relaxation»",
    "spaDayRelaxationDesc": "SPA Day Relaxation is designed for those who dream of an oasis of peace and long-awaited relaxation. Lymphatic drainage and relaxing techniques, signature Ayurvedic rituals, and aromatherapy will provide rest for your body and soul. The result of this program is the restoration of balance in your body.",
    "threeDaysPrograms": "Three days programs",
    "threeDaysProgramsCheckIn": "Please, enter the suitable check-in date for three days program of {{optionName}}. The format should be DD/MM/YYYY",
    "antiStressWeekend": "Anti-stress Weekend",
    "antiStressWeekendDesc": "A variety of sensations and flavors for daily relaxation: cleansing and regenerating balneological treatments, SPA rituals, moisturizing mousses, and nourishing components from herbs and spices; exclusive massage techniques and fitness training; dietary nutrition. A reset after stressful weekdays, restoring your body’s strength and energy, and balancing the connection between Body, Mind, and Spirit. The program is designed for men and women who value their time and care about their health.",
    "weekendEasternStyle": "Weekend in Eastern style",
    "weekendEasternStyleDesc": "A unique journey through the enchanting corners of the Land of Eden, where the richness of sensations, tastes, sounds, and aromas unfolds. We will introduce you to ancient systems of knowledge that promote physical and mental well-being, eliminate stress and depression, and restore your inner Dao. The Eastern-style weekend is a program filled with therapeutic treatments. The light herbal scents of ubtan and oils will bring freshness to every Ayurvedic ritual, acting gently and delicately, resulting in complete relaxation. After these treatments, your skin will be renewed and radiant, smooth and velvety. What’s the secret, you ask? It’s very simple: herbal components, essential oils, extracts, healing muds, and oils activate metabolic processes through contact with the skin, initiating detoxification in the body and improving overall well-being. All procedures in the program are aimed at restoring the body’s natural state of health.",
    "expressRecoveryOfTheBody": "Express recovery of the body",
    "expressRecoveryOfTheBodyDesc": "Tired of the fast-paced life in the metropolis? Then this program is exactly what you need. It will allow your body to recover in a short period of time. Express procedures are designed to sculpt your body at a rapid pace. A variety of balneological and massage treatments in the Express Body Recovery program will speed up and enhance your body’s regeneration processes, providing strength and energy.",
    "spaDetox": "SPA Detox",
    "spaDetoxDesc": "The 'SPA Detox' program is a modern express wellness course based on relaxation and cleansing of the body. The program is designed in such a way that you first restore harmony with your inner spiritual world and then activate all your physical strength. You will experience a wellness complex of physiotherapeutic procedures that use water, seaweed, healing peat, and therapeutic essential oils. The three-day 'SPA Detox' program is a unique and natural set of therapeutic and wellness treatments that will initiate detoxification and help you accumulate vital energy. Once you return to your daily life, you will have these valuable insights at your disposal, which you can use for your benefit every day. We guarantee that before you know it, the reflection in the mirror will reveal a transformed person, with new strength and thoughts that can change the course of your life.",
    "mentalHealth": "Mental Health",
    "mentalHealthDesc": "Each of us strives for harmony of soul and body, preserving inner resources, maintaining productivity, and experiencing happiness in all aspects of life, filling every moment of existence with vibrant emotions. Often, we begin to feel like life is passing us by, our body and mind moving at different speeds, and sometimes we seem to stop and can’t move forward, yet we continue our daily marathon of tasks. These feelings lead to mental and physical exhaustion. The Mental Health program is based on psychotherapeutic techniques, breathing practices, yoga therapy, and restorative body treatments that together achieve a holistic effect. This program restores the balance between the spiritual and the physical, providing an inexhaustible source of energy and a sense of a truly fulfilling life, freeing us from the syndrome of waiting. By going through the program at Edem Clinic, you will experience the authenticity of touch, rediscover your sense of smell, taste, and sound, and perceive the world and yourself in a new way! You will once again feel the strength within you, the desire and energy to fulfill your dreams and reach new heights. Joyfulness, openness, spontaneity, and creativity—you will be filled with them once again!",
    "edemClinic": "Edem Clinic",
    "detoxNew": "Detox New",
    "detoxNewDescription": "Based on extensive experience, a proprietary detox program was created, aimed at normalizing weight, enhancing the body's systems for eliminating exo- and endotoxins and free radicals, and reducing oxidative stress on the body. The specially developed methods are based on scientifically proven principles and personalized care to prevent aging processes. The program is aimed at restoring cell functions, stabilizing and accelerating metabolism, and enhancing the body's vital forces. During the program, a combination of molecular water, hydro-, phyto-, peloid therapy, and drainage techniques are used. The personalized nutrition program is supervised by dieticians based on your clinical tests, offering the best detox nutrition, improving the absorption of vitamins and microelements. You'll receive recommendations on how to adjust your diet and lifestyle after the program. The team of curators will monitor the results based on comprehensive assessments to identify deficiencies, stimulate the detox process, and promote a healthier lifestyle. \n\n Diagnostics: \n - Consultation with the head physician of the program (initial examination, dynamic analysis, interpretation of results, final consultation with recommendations) (1 session) \n - Consultation with the head dietitian (initial consultation, dynamic observation, final consultation) (1 session) \n - Laboratory screening by Edem (comprehensive metabolic and inflammatory markers) (1 session) \n - Ultrasound diagnostics (liver, gallbladder, bile ducts, pancreas, kidneys, bladder, spleen, thyroid, adrenal glands) (1 session) \n - Body composition analysis (56 parameters) (2 sessions) \n - Baseline diagnostics for minerals and vitamins (1 session) \n - Assessment of oxidative stress levels (1 session) \n \n Detox Procedures: \n - Proprietary detox complex (5 sessions) \n - Physical rehabilitation session (under the supervision of an orthopedic-traumatologist) (3 sessions) \n - Oxygen-wave barotherapy with chromotherapy (or hypoxic therapy with electrostimulation) (6 sessions, choice determined by physician) \n - Dry carbonic bath (1 session) \n \n Dietology and Nutrition: \n - Nutrition based on the Healthy Life/Detox concept \n - Detox phytotherapy \n - Personalized vitamin and micronutrient therapy tailored to clinical needs and deficiencies \n \n Additional options: \n - Access to the SPA area (pool, gym, Roman sauna, steam bath, Finnish sauna, hammam chairs, hydromassage mini-pool, Swiss shower (circular), Kneipp path, ice fountain, phytobar) \n - Group fitness sessions (Nordic walking, Black Roll training, aqua aerobics, TRX, Bit Zone, morning exercises, Fly yoga) \n - Fixed-rate plan \n\n Duration: 7 days",
    "productivity": "Productivity",
    "productivityDescription": "The program is designed for quick restoration of energy, which has been depleted by complex and intense work, to restore the emotional component of life. It is recommended for workaholics, people in the early stages of emotional burnout, or those showing signs of chronic fatigue syndrome. The program takes place under the supervision of a psychotherapist. A specially selected balneological complex with hydro-massage baths and restorative peloid therapy will allow you to quickly recover from dystonic manifestations. The massage complex will help relieve muscle spasms, restore the balance between the sympathetic and parasympathetic nervous systems. Internal ozone therapy will allow you to feel the biorevitalization of the body, stimulate the immune system, and promote tissue repair. The nutrition during the program also follows proper proportions of proteins, fats, and carbohydrates, with microelements and vitamins for rapid replenishment of deficient ingredients and to restore proper metabolism. \n Procedures: \n - Hydro-, phyto-, and aromatherapy (2 sessions) \n - Mud and phyto treatment with floating (2 sessions) \n - Energy hydromassage (2 sessions) \n - Session with a psychotherapist (1 session) \n - San-Shiro massage (1 session) \n - Deep body massage (60 min) (1 session) \n - Sports massage (1 session) \n - Physical rehabilitation session (1 session) \n - Outdoor activities (vineyard/garden/workhorse) (1 session) \n - Personal fitness sessions (Fly-yoga/SUP) (2 sessions) \n - Ozone therapy (biorevitalization of the body) (2 sessions) \n - Nutrition based on the Healthy Life concept (3 sessions) \n \n Additional options: \n - Access to the SPA area (pool, gym, Roman sauna, steam bath, Finnish sauna, hammam chairs, hydromassage mini-pool, Swiss shower (circular), Kneipp path, ice fountain, phytobar) \n Group fitness sessions (Nordic walking, Black Roll training, aqua aerobics, TRX, Bit Zone, morning exercises, Fly yoga) \n - Fixed-rate plan \n\n Duration: 3 days",
    "detoxBody": "Detox Body",
    "detoxBodyDescription": "The program provides a deep impact on the body’s structure to improve skin elasticity, tone, and contour, preventing skin aging processes. The goal of the program is to maximize the impact on the metabolic correction of connective tissue in the skin to improve and accelerate its regeneration and structural elements by inhibiting collagen biodegradation and its denaturation processes. By combining restorative procedures, we mitigate the harmful effects of environmental factors, unhealthy lifestyles, and aging. The symmetry of your body will improve, and the skin will achieve a healthy look and physiological relief. The program utilizes a combination of physical, temperature, pharmaceutical, and other factors in ways and dosages that guarantee the maximum effect. The program's lead doctor will create a personal plan for recovery based on your needs and experience, considering the most popular procedures among our guests. This plan is designed to prepare you for important events. A critical success factor for achieving the desired result is the precise combination of procedures, supplements, and specific nutrition. The program is supervised by Edem Clinic dermatologists, who may suggest additional body aesthetics procedures if needed. \n\n Diagnostics: \n - Dermatologist consultation (1 session) \n \n Procedures: \n - Proprietary detox peel (skin peel and Vichy shower) (1 session) \n - Submerged manual relaxation hydromassage (1 session) \n - Submerged manual toning hydromassage (2 sessions) \n - SPA capsule session with reverse cleansing (1 session) \n - Molecular therapy using cold apparatus (1 session) \n - Vitamin bath in Detox style (1 session) \n - Personal training session with a trainer (rhythmic and passive stretching) (2 sessions) \n \n Dietology and Nutrition: \n - Detox strong nutrition \n - Detox phytotherapy \n \n Additional options: \n - Access to the SPA area (pool, gym, Roman sauna, steam bath, Finnish sauna, hammam chairs, hydromassage mini-pool, Swiss shower (circular), Kneipp path, ice fountain, phytobar) \n Group fitness sessions (Nordic walking, Black Roll training, aqua aerobics, TRX, Bit Zone, morning exercises, Fly yoga) \n - Fixed-rate plan \n\n Duration: 3 days",
    "recoveryAndDetectionOfDiseaseRisks": "Recovery and detection of disease risks",
    "recoveryAndDetectionOfDiseaseRisksDescription": "The program for recovery and risk identification of diseases is based on four scientific evidence-based approaches to the body: prediction, prevention, personalization, and precision. The program uses personalized, preventive medical approaches to diagnosis and predicting the development of possible diseases, 'body as a resource for health,' which influence aging processes and prevent them. Proprietary methods of treatment help improve the body's self-regulation, increase energy, and trigger biorevitalization processes. The team of doctors will provide you with instructions on how to work with your body in areas like nutrition (considering your body's characteristics), nutritional support, and prevention and prediction of diseases, which generally improves your quality of life. \n\n Diagnostics: \n - Consultation with the head physician of the program (initial examination, dynamic analysis, interpretation of tests, final consultation with recommendations) (1 session) \n - Consultation with the head dietitian (initial consultation, dynamic observation, final consultation) (1 session) \n - Laboratory screening by Edem (1 session) \n - Ultrasound diagnostics (complex research: liver, gallbladder, bile ducts, pancreas, kidneys, bladder, spleen, abdominal vessels, thyroid, neck, lymph nodes) (1 session) \n - Ultrasound diagnostics of male reproductive organs/prostate (1 session) \n - Ultrasound diagnostics of lungs and pleural cavity (1 session) \n - Ultrasound diagnostics of arteries and deep veins of the lower extremities (1 session) \n - Stress ECG test with electrocardiography monitoring during ergometry and heart ultrasound (1 session) \n - Body composition analysis (56 parameters) (1 session) \n - Comprehensive assessment of the body for minerals, vitamins, essential trace elements, and oxidative stress levels (1 session) \n - Bioenergetic diagnostics and correction (1 session) \n - Antioxidant therapy (1 session) \n - 3D skin diagnostics on Oprata Dome analyzer (1 session) \n \n Procedures: \n - Proprietary detox complex: hydro-, phyto-, aromatherapy with massage (2 sessions) \n - Mud and phyto treatment with floating (1 session) \n - Joint massage and manual therapy (1 session) \n - Consultation with a rehabilitation specialist on physical training (1 session) \n - Local body wellness SPA capsule with reverse mud therapy (1 session) \n - Dry carbonic bath (1 session) \n - Salt and cryotherapy (5 sessions) \n \n Dietology and Nutrition: \n - Nutrition based on the Healthy Life concept \n - Individual approach to vitamin and micronutrient therapy for clinical conditions and deficiencies in the body \n - Detox phytotherapy \n \n Additional options: \n - Access to the SPA area (pool, gym, Roman sauna, steam bath, Finnish sauna, hammam chairs, hydromassage mini-pool, Swiss shower (circular), Kneipp path, ice fountain, phytobar) \n - Group fitness sessions (Nordic walking, Black Roll training, aqua aerobics, TRX, Bit Zone, morning exercises, Fly yoga)",
    "detoxBodyAndMind": "Detox Body & Mind",
    "detoxBodyAndMindDescription": "The program provides organic and psycho-emotional detoxification, cleansing, and elimination of exo- and endotoxins that accumulate in the body due to improper lifestyle choices (daily routine, diet, and eating habits, chronic stress), environmental factors, and poor nutrition. It is recommended for chronic fatigue, psycho-emotional burnout, and 'stress overload' conditions. Specially developed methods are based on scientifically proven principles and personalized care, utilizing the latest knowledge in anti-aging processes. The program aims to restore cell functions, stabilize homeostasis, accelerate metabolism, and enhance the body's vital forces. During the program, a combination of water, hydro-, phyto-, peloid therapy, and air methods is applied. The program focuses on the central nervous system (psychological, stress states) using classic methods of the proprietary detox program. \n Procedures: - Bioenergetic diagnostics and correction (2 sessions) Consultation with a psychotherapist (1 consultation, 4 sessions) \n - Proprietary detox complex: hydro-, phyto-, and aromatherapy (4 sessions) \n - Mud and phyto treatment with floating (2 sessions) \n - Mono-purification of the liver (Lokka 'Cleansing') (1 session) \n - Oxygen-wave barotherapy with chromotherapy (2 sessions) \n - Physical rehabilitation sessions (joint diagnosis with an orthopedic-traumatologist) (1 session) \n - Personal training with a trainer (2 sessions) \n - Group fitness training (Nordic walking, Black Roll training, aqua aerobics, TRX, Bit Zone, morning exercises, Fly yoga) (7 sessions) \n - Detox nutrition (7 sessions) \n - Phytocomplex (1 session) \n - Detox mineral water-balancing treatment (1 session) \n \n Dietology and Nutrition: Nutrition based on the Detox concept \n Additional options: \n - Access to the SPA area (pool, gym, Roman sauna, steam bath, Finnish sauna, hammam chairs, hydromassage mini-pool, Swiss shower (circular), Kneipp path, ice fountain, phytobar) \n\n Duration: 7 days",
    "reEnergy": "Re-energy",
    "reEnergyDescription": "The program is designed for those who want to take a short break to recharge and improve their well-being. In this program, we have included the most effective recovery methods developed by specialists at the Health Recovery Center. It includes a special diet consisting of healthy and light meals prepared according to the principles of proper nutrition. \n Procedures: \n - Hydro-, phyto-, and aromatherapy (2 sessions) \n - Mud and phyto treatment with floating (2 sessions) \n - Energy hydromassage (2 sessions) \n Manual lymphatic drainage massage (1 session) \n - Multi-sculptural modeling procedure (1 session) \n - Pressotherapy (1 session) \n - Ayurvedic facial ritual based on dosha type (1 session) \n - Psycho-emotional harmonization in a salt room with aromatherapy (2 sessions) \n Dietology and Nutrition: \n Nutrition based on the Healthy Life concept \n Additional options: \n - Access to the SPA area (pool, gym, Roman sauna, steam bath, Finnish sauna, hammam chairs, hydromassage mini-pool, Swiss shower (circular), Kneipp path, ice fountain, phytobar) \n - Fixed-rate plan \n - Group fitness sessions (Nordic walking, Black Roll training, aqua aerobics, TRX, Bit Zone, morning exercises, Fly yoga) \n\n Duration: 3 days.",
    "fitHealth": "FitHealth",
    "fitHealthDescription": "One of the most effective express programs that incorporates the most result-driven methods of modern fitness. The program's comprehensive approach, combined with medical diagnostics, allows for individual progress and provides the quickest path to achieving results. The program is suitable for both beginners and professional athletes. It targets goals such as weight loss, sports rehabilitation, the development of techniques for performing exercises and maintaining posture, and localized impact on problem areas of the abdomen. \n Focused on: \n - Metabolic correction and weight reduction \n - Localized impact on problem areas of the abdomen \n - Strengthening of the spinal muscles \n - Achieving personal goals, obtaining an aesthetically pleasing figure and well-being \n - Harmonious physical and mental development \n *A doctor's consultation is recommended before starting the program. This consultation is not included in the program. \n \n Procedures: \n - Functional testing of physical fitness level (1 session) \n - Personal training with methods developed by rehabilitation doctors (3 sessions) \n - Hydro-, phyto-, and aromatherapy (mineral and sports recovery baths) (2 sessions) \n - Mud and phyto treatment with floating (1 session) \n - Energy hydromassage (Vichy shower) (3 sessions) \n - Sports toning massage for various muscle groups (3 sessions) \n - Head and neck massage (1 session) \n - Relaxation massage (1 session) \n - Abdominal massage (manual and apparatus techniques with contrast methods) (1 session) \n \n Nutritionology, Dietology, and Nutrition: \n - Nutritional support (adaptogens, vitamins, amino acid complexes) \n - Nutrition based on the Healthy Life concept \n \n Additional options: \n Access to the SPA area (pool, gym, Roman sauna, steam bath, Finnish sauna, hammam chairs, hydromassage mini-pool, Swiss shower (circular), Kneipp path, ice fountain, phytobar) \n Group fitness sessions (Nordic walking, Black Roll training, aqua aerobics, TRX, Bit Zone, morning exercises, Fly yoga) \n Fixed-rate plan \n\n Duration: 3 days",
    "sport": "Sport",
    "golf": "Golf",
    "tennis": "Tennis",
    "aquaAerobics": "Aqua Aerobics",
    "yoga": "Yoga",
    "kenesis": "Kenesis",
    "miniFootball": "Mini Football",
    "scandinavianWalking": "Scandinavian walking",
    "fitness": "Fitness",
    "sup": "Sup",
    "flyYoga": "Fly Yoga",
    "powerYoga": "Power Yoga",
    "backHorseRiding": "Back Horse Riding",
    "restaurants": "Restaurants",
    "restaurantPanorama": "Panorama",
    "restaurantDeVine": "De Vine",
    "restaurantByTheLake": "Terrace by the lake",
    "restaurantEdem": "Terrace by the lake",
    "golfClub": "Golf Club",
    "generalInformation": "General information",
    "roomServices": "Room Services",
    "extraCleaning": "Extra cleaning",
    "laundry": "Laundry",
    "transfer": "Transfer",
    "foodFromRestaurantIntoRoom": "Food from restaurant into room",
    "bookThisOption": "Book this option",
    "backToServices": "Back to services",
    "optionNotFound": "Option {{optionName}} was not found.",
    "programNotFound": "Program {{programNotFound}} was not found.",
    "serviceNotFound": "Service {{serviceNotFound}} was not found."
  }
}
